In [2]:
import pandas as pd

In [4]:
file = "Resources/budget_data.csv"
df = pd.read_csv(file)
df.head()

     Date  Profit/Losses
0  Jan-10        1088983
1  Feb-10        -354534
2  Mar-10         276622
3  Apr-10        -728133
4  May-10         852993

In [5]:
df.Date.count()

86

In [6]:
df["Profit/Losses"].sum()

22564198

In [8]:
df["Changes"] = df["Profit/Losses"].diff()
df.head()

     Date  Profit/Losses    Changes
0  Jan-10        1088983        NaN
1  Feb-10        -354534 -1443517.0
2  Mar-10         276622   631156.0
3  Apr-10        -728133 -1004755.0
4  May-10         852993  1581126.0

In [9]:
df.Changes.mean()

-8311.105882352942

In [10]:
mask = df.Changes == df.Changes.max()
df.loc[mask]

      Date  Profit/Losses    Changes
79  Aug-16         951227  1862002.0

In [11]:
mask = df.Changes == df.Changes.min()
df.loc[mask]

      Date  Profit/Losses    Changes
49  Feb-14        -946748 -1825558.0